# SetDiffuseColor Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EffectInstance..::..SetDiffuseColor Method
EffectInstance Class See Also
---
Sets the diffuse color parameter of the effect instance.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetDiffuseColor(
	Color color
)
```

Visual Basic
---
```text
Public Sub SetDiffuseColor ( _
	color As Color _
)
```

Visual C++
---
```text
public:
void SetDiffuseColor(
	Color^ color
)
```

# ### Parameters
color
    Type: Autodesk.Revit.DB..::..Color The diffuse color value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace